rtzaudio/STC1200_TivaTM4C1294NCPDT/STC1200_TM4C1294NCPDT.c
/*
 *  EMAC configuration structure
 *  Set user/company specific MAC octates. The following sets the address
 *  to ff-ff-ff-ff-ff-ff. Users need to change this to make the label on
 *  their boards.
 */
//unsigned char macAddress[6] = {0xff, 0xff, 0xff, 0xff, 0xff, 0xff};
unsigned char macAddress[6] = {0x00, 0x10, 0xfa, 0x6e, 0x38, 0x4a};

const EMACSnow_HWAttrs emacHWAttrs[STC1200_EMACCOUNT] = {
    {
        .baseAddr = EMAC0_BASE,
        .intNum = INT_EMAC0,
        .intPriority = (~0),
        .macAddress = macAddress
    }
};

const EMAC_Config EMAC_config[] = {
    {
        .fxnTablePtr = &EMACSnow_fxnTable,
        .object = &emacObjects[0],
        .hwAttrs = &emacHWAttrs[0]
    },
    {NULL, NULL, NULL}
};

/*
 *  ======== STC1200_initEMAC ========
 */

/* Don't call Board_initEMAC() in main(). Instead call it in a task after you get the MAC address.
 *
 * You have a couple options to delay the starting of the NDK stack:
 * 1. Do not graphically generate it. Instead supply the thread yourself and start it after calling Board_initEMAC().
 * 2. Add a startup hook function into the stack via the .cfg file. Have that function block on a semaphore.
 * Post the semaphore after you call Board_initEMAC(). The hook is called very early in the stack thread,
 * well before the MAC address is referenced.
 *
 * .cfg file
 *  Global.stackBeginHook = "&myNDKStackBeginHook";
 *
 * .c file
 *  void myNDKStackBeginHook()
 *  {
 *      Semaphore_pend(mySem, BIOS_WAIT_FOREVER);
 *  }
 *
 */

void STC1200_initEMAC(void)
{
    memcpy(macAddress, g_sys.ui8MAC, 6);

#if 0
    uint32_t ulUser0, ulUser1;

    /* Get the MAC address */
    FlashUserGet(&ulUser0, &ulUser1);

    if ((ulUser0 != 0xffffffff) && (ulUser1 != 0xffffffff)) {
        System_printf("Using MAC address in flash\n");
        /*
         *  Convert the 24/24 split MAC address from NV ram into a 32/16 split MAC
         *  address needed to program the hardware registers, then program the MAC
         *  address into the Ethernet Controller registers.
         */
        macAddress[0] = ((ulUser0 >>  0) & 0xff);
        macAddress[1] = ((ulUser0 >>  8) & 0xff);
        macAddress[2] = ((ulUser0 >> 16) & 0xff);
        macAddress[3] = ((ulUser1 >>  0) & 0xff);
        macAddress[4] = ((ulUser1 >>  8) & 0xff);
        macAddress[5] = ((ulUser1 >> 16) & 0xff);
    }
    else if (macAddress[0] == 0xff && macAddress[1] == 0xff &&
             macAddress[2] == 0xff && macAddress[3] == 0xff &&
             macAddress[4] == 0xff && macAddress[5] == 0xff) {
        System_abort("Change the macAddress variable to match your boards MAC sticker");
    }
#endif

    // Enable peripheral EPHY0
    SysCtlPeripheralEnable(SYSCTL_PERIPH_EPHY0);
    
    // Enable pin PK6 for EPHY0 EN0LED1
    GPIOPinConfigure(GPIO_PK6_EN0LED1);
    GPIOPinTypeEthernetLED(GPIO_PORTK_BASE, GPIO_PIN_6);

    // Enable pin PK4 for EPHY0 EN0LED0
    GPIOPinConfigure(GPIO_PK4_EN0LED0);
    GPIOPinTypeEthernetLED(GPIO_PORTK_BASE, GPIO_PIN_4);

    /* Once EMAC_init is called, EMAC_config cannot be changed */
    EMAC_init();
}

/*
 *  =============================== GPIO ===============================
 */
/* Place into subsections to allow the TI linker to remove items properly */
#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_SECTION(GPIOTiva_config, ".const:GPIOTiva_config")
#endif

#include <ti/drivers/GPIO.h>
#include <ti/drivers/gpio/GPIOTiva.h>

/*
 * Array of Pin configurations
 * NOTE: The order of the pin configurations must coincide with what was
 *       defined in STC1200_TM4C1294NCPDT.h
 * NOTE: Pins not used for interrupts should be placed at the end of the
 *       array.  Callback entries can be omitted from callbacks array to
 *       reduce memory usage.
 */
GPIO_PinConfig gpioPinConfigs[STC1200_GPIOCOUNT] = {
	/*** INPUT PINS ***/
    /* STC1200_BTN_RESET */
    GPIOTiva_PH_0 | GPIO_CFG_INPUT | GPIO_CFG_IN_INT_RISING,
    /* STC1200_BTN_CUE */
    GPIOTiva_PH_1 | GPIO_CFG_INPUT | GPIO_CFG_IN_INT_RISING,
    /* STC1200_BTN_SEARCH */
    GPIOTiva_PH_2 | GPIO_CFG_INPUT | GPIO_CFG_IN_INT_RISING,
	/* STC1200_STOP_DETECT_N */
	GPIOTiva_PM_0 | GPIO_CFG_INPUT | GPIO_CFG_IN_INT_FALLING,
	/* STC1200_PLAY_DETECT_N */
	GPIOTiva_PM_1 | GPIO_CFG_INPUT | GPIO_CFG_IN_INT_FALLING,
    /* STC1200_EXPIO_PK3 */
    GPIOTiva_PK_3 | GPIO_CFG_INPUT | GPIO_CFG_IN_PU | GPIO_CFG_IN_INT_FALLING,
	/* STC1200_DIPSW_CFG1 */
	GPIOTiva_PL_4 | GPIO_CFG_INPUT | GPIO_CFG_IN_PU,
	/* STC1200_DIPSW_CFG2 */
	GPIOTiva_PL_5 | GPIO_CFG_INPUT | GPIO_CFG_IN_PU,
	/* STC1200_SPEED_SELECT */
	GPIOTiva_PQ_0 | GPIO_CFG_INPUT,
    /*** OUTPUTS PINS ***/
    /* STC1200_EXPIO_PD4 */
    GPIOTiva_PD_4 | GPIO_CFG_INPUT,
    /* STC1200_EXPIO_PD5 */
    GPIOTiva_PD_5 | GPIO_CFG_INPUT,
    /* STC1200_EXPIO_PP2 */
    GPIOTiva_PP_2 | GPIO_CFG_INPUT,
    /* STC1200_EXPIO_PP3 */
    GPIOTiva_PP_3 | GPIO_CFG_INPUT,
    /* STC1200_EXPIO_PP4 */
    GPIOTiva_PP_4 | GPIO_CFG_INPUT,
    /* STC1200_EXPIO_PP5 */
    GPIOTiva_PP_5 | GPIO_CFG_INPUT,
    /* STC1200_EXPIO_PK2 */
    GPIOTiva_PK_2 | GPIO_CFG_OUTPUT | GPIO_CFG_OUT_LOW,
    /* STC1200_RESET_AVR_N */
    GPIOTiva_PE_0 | GPIO_CFG_OUTPUT | GPIO_CFG_OUT_HIGH,
    /* STC1200_RS422_RE_N */
    GPIOTiva_PK_5 | GPIO_CFG_OUTPUT | GPIO_CFG_OUT_HIGH,
    /* STC1200_RS422_DE */
    GPIOTiva_PK_7 | GPIO_CFG_OUTPUT | GPIO_CFG_OUT_LOW,
    /* STC1200_STOP_N */
    GPIOTiva_PM_2 | GPIO_CFG_OUTPUT | GPIO_CFG_OUT_HIGH,
    /* STC1200_PLAY_N */
    GPIOTiva_PM_3 | GPIO_CFG_OUTPUT | GPIO_CFG_OUT_HIGH,
    /* STC1200_FWD_N */
    GPIOTiva_PM_4 | GPIO_CFG_OUTPUT | GPIO_CFG_OUT_HIGH,
    /* STC1200_REW_N */
    GPIOTiva_PM_5 | GPIO_CFG_OUTPUT | GPIO_CFG_OUT_HIGH,
    /* STC1200_MOTION_REW */
    GPIOTiva_PM_6 | GPIO_CFG_OUTPUT | GPIO_CFG_OUT_HIGH,
    /* STC1200_MOTION_FWD */
    GPIOTiva_PM_7 | GPIO_CFG_OUTPUT | GPIO_CFG_OUT_HIGH,
    /* STC1200_SEARCHING */
    GPIOTiva_PQ_1 | GPIO_CFG_OUTPUT | GPIO_CFG_OUT_HIGH,
    /* STC1200_TAPE_DIR */
    GPIOTiva_PQ_2 | GPIO_CFG_OUTPUT | GPIO_CFG_OUT_HIGH,
    /* STC1200_LAMP_PLAY */
    GPIOTiva_PQ_3 | GPIO_CFG_OUTPUT | GPIO_CFG_OUT_LOW,
    /* STC1200_LAMP_FWDREW */
    GPIOTiva_PL_0 | GPIO_CFG_OUTPUT | GPIO_CFG_OUT_LOW,
    /* STC1200_STAT_LED */
    GPIOTiva_PF_4 | GPIO_CFG_OUTPUT | GPIO_CFG_OUT_LOW,
    /* STC1200_EXPIO_PF2_SSI3FS */
    GPIOTiva_PF_2 | GPIO_CFG_OUTPUT | GPIO_CFG_OUT_HIGH,
    /* STC1200_EXPIO_PA3_SSI0FS*/
    GPIOTiva_PA_3 | GPIO_CFG_OUTPUT | GPIO_CFG_OUT_HIGH,
};

