rtzaudio/STC1200_TivaTM4C1294NCPDT/STC1200_TM4C1294NCPDT.c
/*
 * Array of callback function pointers
 * NOTE: The order of the pin configurations must coincide with what was
 *       defined in DK_TM4C129X.h
 * NOTE: Pins not used for interrupts can be omitted from callbacks array to
 *       reduce memory usage (if placed at end of gpioPinConfigs array).
 */
GPIO_CallbackFxn gpioCallbackFunctions[] = {
    NULL,  /* STC1200_BTN_RESET */
    NULL,  /* STC1200_BTN_CUE */
    NULL,  /* STC1200_BTN_SEARCH */
    NULL,  /* STC1200_STOP_DETECT_N */
    NULL,  /* STC1200_PLAY_DETECT_N */
    NULL,  /* STC1200_SMPTE_INT_N */
};

/* The device-specific GPIO_config structure */
const GPIOTiva_Config GPIOTiva_config = {
    .pinConfigs = (GPIO_PinConfig *)gpioPinConfigs,
    .callbacks = (GPIO_CallbackFxn *)gpioCallbackFunctions,
    .numberOfPinConfigs = sizeof(gpioPinConfigs)/sizeof(GPIO_PinConfig),
    .numberOfCallbacks = sizeof(gpioCallbackFunctions)/sizeof(GPIO_CallbackFxn),
    .intPriority = (~0)
};

/*
 *  ======== STC1200_initGPIO ========
 */
void STC1200_initGPIO(void)
{
    // Enable pin PA3 for GPIOOutput
    GPIOPinTypeGPIOOutput(GPIO_PORTA_BASE, GPIO_PIN_3);

    // Enable pin PD4 for GPIOInput
    GPIOPinTypeGPIOInput(GPIO_PORTD_BASE, GPIO_PIN_4);
    // Enable pin PD5 for GPIOInput
    GPIOPinTypeGPIOOutput(GPIO_PORTD_BASE, GPIO_PIN_5);

    // Enable pin PE0 for GPIOOutput
    GPIOPinTypeGPIOOutput(GPIO_PORTE_BASE, GPIO_PIN_0);

    // Enable pin PF2 for GPIOOutput
    GPIOPinTypeGPIOOutput(GPIO_PORTF_BASE, GPIO_PIN_2);

    // Enable pin PG0 for GPIOOutput
    GPIOPinTypeGPIOOutput(GPIO_PORTG_BASE, GPIO_PIN_0);
    // Enable pin PG1 for GPIOOutput
    GPIOPinTypeGPIOOutput(GPIO_PORTG_BASE, GPIO_PIN_1);
    
    // Enable pin PH0 for GPIOInput
    GPIOPinTypeGPIOInput(GPIO_PORTH_BASE, GPIO_PIN_0);
    // Enable pin PH1 for GPIOInput
    GPIOPinTypeGPIOInput(GPIO_PORTH_BASE, GPIO_PIN_1);
    // Enable pin PH2 for GPIOInput
    GPIOPinTypeGPIOInput(GPIO_PORTH_BASE, GPIO_PIN_2);

    // Enable pin PK2 for GPIOOutput
    GPIOPinTypeGPIOOutput(GPIO_PORTK_BASE, GPIO_PIN_2);
    // Enable pin PK3 for GPIOInput
    GPIOPinTypeGPIOInput(GPIO_PORTK_BASE, GPIO_PIN_3);
    // Enable pin PK5 for GPIOOutput
    GPIOPinTypeGPIOOutput(GPIO_PORTK_BASE, GPIO_PIN_5);
    // Enable pin PK7 for GPIOOutput
    GPIOPinTypeGPIOOutput(GPIO_PORTK_BASE, GPIO_PIN_7);
        
    // Enable pin PL4 for GPIOInput
    GPIOPinTypeGPIOInput(GPIO_PORTL_BASE, GPIO_PIN_4);
    // Enable pin PL5 for GPIOInput
    GPIOPinTypeGPIOInput(GPIO_PORTL_BASE, GPIO_PIN_5);    

    // Enable pin PM0 for GPIOInput
    GPIOPinTypeGPIOInput(GPIO_PORTM_BASE, GPIO_PIN_0);    
    // Enable pin PM1 for GPIOInput
    GPIOPinTypeGPIOInput(GPIO_PORTM_BASE, GPIO_PIN_1);
    // Enable pin PM2 for GPIOOutput
    GPIOPinTypeGPIOOutput(GPIO_PORTM_BASE, GPIO_PIN_2);    
    // Enable pin PM3 for GPIOOutput
    GPIOPinTypeGPIOOutput(GPIO_PORTM_BASE, GPIO_PIN_3);
    // Enable pin PM4 for GPIOOutput
    GPIOPinTypeGPIOOutput(GPIO_PORTM_BASE, GPIO_PIN_4);
    // Enable pin PM5 for GPIOOutput
    GPIOPinTypeGPIOOutput(GPIO_PORTM_BASE, GPIO_PIN_5);
    // Enable pin PM6 for GPIOOutput
    GPIOPinTypeGPIOOutput(GPIO_PORTM_BASE, GPIO_PIN_6);
    // Enable pin PM7 for GPIOOutput
    GPIOPinTypeGPIOOutput(GPIO_PORTM_BASE, GPIO_PIN_7);
    
    // Enable pin PP2 for GPIOInput
    GPIOPinTypeGPIOInput(GPIO_PORTP_BASE, GPIO_PIN_2);
    // Enable pin PP3 for GPIOInput
    GPIOPinTypeGPIOInput(GPIO_PORTP_BASE, GPIO_PIN_3);
    // Enable pin PP4 for GPIOOutput
    GPIOPinTypeGPIOInput(GPIO_PORTP_BASE, GPIO_PIN_4);
    // Enable pin PP5 for GPIOInput
    GPIOPinTypeGPIOInput(GPIO_PORTP_BASE, GPIO_PIN_5);
    
    // Enable pin PQ0 for GPIOInput
    GPIOPinTypeGPIOInput(GPIO_PORTQ_BASE, GPIO_PIN_0);
    // Enable pin PQ1 for GPIOOutput
    GPIOPinTypeGPIOOutput(GPIO_PORTQ_BASE, GPIO_PIN_1);
    // Enable pin PQ2 for GPIOOutput
    GPIOPinTypeGPIOOutput(GPIO_PORTQ_BASE, GPIO_PIN_2);

	/* Once GPIO_init is called, GPIO_config cannot be changed */
    GPIO_init();
}

/*
 *  =============================== I2C ===============================
 */
/* Place into subsections to allow the TI linker to remove items properly */
#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_SECTION(I2C_config, ".const:I2C_config")
#pragma DATA_SECTION(i2cTivaHWAttrs, ".const:i2cTivaHWAttrs")
#endif

#include <ti/drivers/I2C.h>
#include <ti/drivers/i2c/I2CTiva.h>

I2CTiva_Object i2cTivaObjects[STC1200_I2CCOUNT];

const I2CTiva_HWAttrs i2cTivaHWAttrs[STC1200_I2CCOUNT] = {
    {
        .baseAddr = I2C0_BASE,
        .intNum = INT_I2C0,
        .intPriority = (~0)
    }
};

const I2C_Config I2C_config[] = {
    {
        .fxnTablePtr = &I2CTiva_fxnTable,
        .object = &i2cTivaObjects[0],
        .hwAttrs = &i2cTivaHWAttrs[0]
    },
    {NULL, NULL, NULL}
};

/*
 *  ======== STC1200_initI2C ========
 */
void STC1200_initI2C(void)
{

    SysCtlPeripheralEnable(SYSCTL_PERIPH_I2C0);

	// Enable pin PB3 for I2C0 I2C0SDA
	GPIOPinConfigure(GPIO_PB3_I2C0SDA);
	GPIOPinTypeI2C(GPIO_PORTB_BASE, GPIO_PIN_3);

	// Enable pin PB2 for I2C0 I2C0SCL
	GPIOPinConfigure(GPIO_PB2_I2C0SCL);
	GPIOPinTypeI2CSCL(GPIO_PORTB_BASE, GPIO_PIN_2);

    I2C_init();
}

/*
 *  =============================== SDSPI ===============================
 */
/* Place into subsections to allow the TI linker to remove items properly */
#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_SECTION(SDSPI_config, ".const:SDSPI_config")
#pragma DATA_SECTION(sdspiTivaHWattrs, ".const:sdspiTivaHWattrs")
#endif

#include <ti/drivers/SDSPI.h>
#include <ti/drivers/sdspi/SDSPITiva.h>

SDSPITiva_Object sdspiTivaObjects[STC1200_SDSPICOUNT];

const SDSPITiva_HWAttrs sdspiTivaHWattrs[STC1200_SDSPICOUNT] = {
    {
        .baseAddr = SSI1_BASE,			/* SPI base address */
        .portSCK  = GPIO_PORTB_BASE,	/* SPI SCK PORT */
        .pinSCK   = GPIO_PIN_5,			/* SCK PIN (PB5) */
        .portMISO = GPIO_PORTE_BASE,	/* SPI MISO PORT */
        .pinMISO  = GPIO_PIN_5,			/* MISO PIN (PE5) */
        .portMOSI = GPIO_PORTE_BASE,	/* SPI MOSI PORT */
        .pinMOSI  = GPIO_PIN_4,			/* MOSI PIN (PE4) */
        .portCS   = GPIO_PORTB_BASE,	/* GPIO CS PORT */
        .pinCS    = GPIO_PIN_4			/* CS PIN (PB4) */
    }
};

const SDSPI_Config SDSPI_config[] = {
    {
        .fxnTablePtr = &SDSPITiva_fxnTable,
        .object = &sdspiTivaObjects[0],
        .hwAttrs = &sdspiTivaHWattrs[0]
    },
    {NULL, NULL, NULL}
};
