rtzaudio/STC1200_TivaTM4C1294NCPDT/STC1200_TM4C1294NCPDT.c
/*
 *  ======== STC1200_initSDSPI ========
 */
void STC1200_initSDSPI(void)
{
    /* Enable SD SSI peripherals */
    SysCtlPeripheralEnable(SYSCTL_PERIPH_SSI1);

    /* SSI-1 Configure Pins */

    // Enable pin PE5 for SSI1 SSI1XDAT1
    GPIOPinConfigure(GPIO_PE5_SSI1XDAT1);
    GPIOPinTypeSSI(GPIO_PORTE_BASE, GPIO_PIN_5);

    // Enable pin PE4 for SSI1 SSI1XDAT0
    GPIOPinConfigure(GPIO_PE4_SSI1XDAT0);
    GPIOPinTypeSSI(GPIO_PORTE_BASE, GPIO_PIN_4);

    // Enable pin PB5 for SSI1 SSI1CLK
    GPIOPinConfigure(GPIO_PB5_SSI1CLK);
    GPIOPinTypeSSI(GPIO_PORTB_BASE, GPIO_PIN_5);

    // Enable pin PB4 for SSI1 SSI1FSS
    GPIOPinConfigure(GPIO_PB4_SSI1FSS);
    GPIOPinTypeSSI(GPIO_PORTB_BASE, GPIO_PIN_4);

    /* Configure pad settings */

    /* SCK (PB5) */
    GPIOPadConfigSet(GPIO_PORTB_BASE,
                     GPIO_PIN_5,
                     GPIO_STRENGTH_4MA, GPIO_PIN_TYPE_STD);
    /* MOSI (PE4) */
    GPIOPadConfigSet(GPIO_PORTE_BASE,
                     GPIO_PIN_4,
                     GPIO_STRENGTH_4MA, GPIO_PIN_TYPE_STD);
    /* MISO (PE5) */
    GPIOPadConfigSet(GPIO_PORTE_BASE,
                     GPIO_PIN_5,
                     GPIO_STRENGTH_4MA, GPIO_PIN_TYPE_STD_WPU);
    /* CS (PB4) */
    GPIOPadConfigSet(GPIO_PORTB_BASE,
                     GPIO_PIN_4,
                     GPIO_STRENGTH_4MA, GPIO_PIN_TYPE_STD);

	SDSPI_init();
}

/*
 *  =============================== SPI ===============================
 */
/* Place into subsections to allow the TI linker to remove items properly */
#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_SECTION(SPI_config, ".const:SPI_config")
#pragma DATA_SECTION(spiTivaDMAHWAttrs, ".const:spiTivaDMAHWAttrs")
#endif

#include <ti/drivers/SPI.h>
#include <ti/drivers/spi/SPITivaDMA.h>

SPITivaDMA_Object spiTivaDMAObjects[STC1200_SPICOUNT];

#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_ALIGN(spiTivaDMAscratchBuf, 32)
#elif defined(__IAR_SYSTEMS_ICC__)
#pragma data_alignment=32
#elif defined(__GNUC__)
__attribute__ ((aligned (32)))
#endif
uint32_t spiTivaDMAscratchBuf[STC1200_SPICOUNT];


const SPITivaDMA_HWAttrs spiTivaDMAHWAttrs[STC1200_SPICOUNT] = {
    {
        .baseAddr = SSI0_BASE,
        .intNum = INT_SSI0,
        .intPriority = (~0),
        .scratchBufPtr = &spiTivaDMAscratchBuf[0],
        .defaultTxBufValue = 0,
        .rxChannelIndex = UDMA_CHANNEL_SSI0RX,
        .txChannelIndex = UDMA_CHANNEL_SSI0TX,
        .channelMappingFxn = uDMAChannelAssign,
        .rxChannelMappingFxnArg = UDMA_CH10_SSI0RX,
        .txChannelMappingFxnArg = UDMA_CH11_SSI0TX
    },
    {
        .baseAddr = SSI2_BASE,
        .intNum = INT_SSI2,
        .intPriority = (~0),
        .scratchBufPtr = &spiTivaDMAscratchBuf[1],
        .defaultTxBufValue = 0,
        .rxChannelIndex = UDMA_SEC_CHANNEL_UART2RX_12,
        .txChannelIndex = UDMA_SEC_CHANNEL_UART2TX_13,
        .channelMappingFxn = uDMAChannelAssign,
        .rxChannelMappingFxnArg = UDMA_CH12_SSI2RX,
        .txChannelMappingFxnArg = UDMA_CH13_SSI2TX
    },
    {
        .baseAddr = SSI3_BASE,
        .intNum = INT_SSI3,
        .intPriority = (~0),
        .scratchBufPtr = &spiTivaDMAscratchBuf[2],
        .defaultTxBufValue = 0,
        .rxChannelIndex = UDMA_SEC_CHANNEL_TMR2A_14,
        .txChannelIndex = UDMA_SEC_CHANNEL_TMR2B_15,
        .channelMappingFxn = uDMAChannelAssign,
        .rxChannelMappingFxnArg = UDMA_CH14_SSI3RX,
        .txChannelMappingFxnArg = UDMA_CH15_SSI3TX
    }
};

const SPI_Config SPI_config[] = {
    {
        .fxnTablePtr = &SPITivaDMA_fxnTable,
        .object = &spiTivaDMAObjects[0],
        .hwAttrs = &spiTivaDMAHWAttrs[0]
    },
    {
        .fxnTablePtr = &SPITivaDMA_fxnTable,
        .object = &spiTivaDMAObjects[1],
        .hwAttrs = &spiTivaDMAHWAttrs[1]
    },
    {
        .fxnTablePtr = &SPITivaDMA_fxnTable,
        .object = &spiTivaDMAObjects[2],
        .hwAttrs = &spiTivaDMAHWAttrs[2]
    },
    {NULL, NULL, NULL},
};

/*
 *  ======== STC1200_initSPI ========
 */
void STC1200_initSPI(void)
{
    /* Enable SSI peripherals */
    SysCtlPeripheralEnable(SYSCTL_PERIPH_SSI0);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_SSI2);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_SSI3);
     
	/* SSI-0 Configure Pins */

    // Enable pin PA4 for SSI0 SSI0XDAT0
    GPIOPinConfigure(GPIO_PA4_SSI0XDAT0);
    GPIOPinTypeSSI(GPIO_PORTA_BASE, GPIO_PIN_4);
    // Enable pin PA5 for SSI0 SSI0XDAT1
    GPIOPinConfigure(GPIO_PA5_SSI0XDAT1);
    GPIOPinTypeSSI(GPIO_PORTA_BASE, GPIO_PIN_5);
    // Enable pin PA3 for SSI0 SSI0FSS
    //GPIOPinConfigure(GPIO_PA3_SSI0FSS);
    //GPIOPinTypeSSI(GPIO_PORTA_BASE, GPIO_PIN_3);
    // Enable pin PA2 for SSI0 SSI0CLK
    GPIOPinConfigure(GPIO_PA2_SSI0CLK);
    GPIOPinTypeSSI(GPIO_PORTA_BASE, GPIO_PIN_2);	

	/* SSI-2 Configure Pins */

    // Enable pin PD3 for SSI2 SSI2CLK
    GPIOPinConfigure(GPIO_PD3_SSI2CLK);
    GPIOPinTypeSSI(GPIO_PORTD_BASE, GPIO_PIN_3);
    // Enable pin PD0 for SSI2 SSI2XDAT1
    GPIOPinConfigure(GPIO_PD0_SSI2XDAT1);
    GPIOPinTypeSSI(GPIO_PORTD_BASE, GPIO_PIN_0);
    // Enable pin PD2 for SSI2 SSI2FSS
    GPIOPinConfigure(GPIO_PD2_SSI2FSS);
    GPIOPinTypeSSI(GPIO_PORTD_BASE, GPIO_PIN_2);
    // Enable pin PD7 for SSI2 SSI2XDAT2
    // First open the lock and select the bits we want to modify in the GPIO commit register.
    HWREG(GPIO_PORTD_BASE + GPIO_O_LOCK) = GPIO_LOCK_KEY;
    HWREG(GPIO_PORTD_BASE + GPIO_O_CR) = 0x80;
    // Now modify the configuration of the pins that we unlocked.
    GPIOPinConfigure(GPIO_PD7_SSI2XDAT2);
    GPIOPinTypeSSI(GPIO_PORTD_BASE, GPIO_PIN_7);
    // Enable pin PD6 for SSI2 SSI2XDAT3
    GPIOPinConfigure(GPIO_PD6_SSI2XDAT3);
    GPIOPinTypeSSI(GPIO_PORTD_BASE, GPIO_PIN_6);
    // Enable pin PD1 for SSI2 SSI2XDAT0
    GPIOPinConfigure(GPIO_PD1_SSI2XDAT0);
    GPIOPinTypeSSI(GPIO_PORTD_BASE, GPIO_PIN_1);

	/* SSI-3 Configure Pins */

    // Enable pin PF3 for SSI3 SSI3CLK
    GPIOPinConfigure(GPIO_PF3_SSI3CLK);
    GPIOPinTypeSSI(GPIO_PORTF_BASE, GPIO_PIN_3);
    // Enable pin PF2 for SSI3 SSI3FSS
    //GPIOPinConfigure(GPIO_PF2_SSI3FSS);
    //GPIOPinTypeSSI(GPIO_PORTF_BASE, GPIO_PIN_2);
    // Enable pin PF1 for SSI3 SSI3XDAT0
    GPIOPinConfigure(GPIO_PF1_SSI3XDAT0);
    GPIOPinTypeSSI(GPIO_PORTF_BASE, GPIO_PIN_1);
    // Enable pin PF0 for SSI3 SSI3XDAT1
    GPIOPinConfigure(GPIO_PF0_SSI3XDAT1);
    GPIOPinTypeSSI(GPIO_PORTF_BASE, GPIO_PIN_0);

    STC1200_initDMA();
    SPI_init();
}
    
