rtzaudio/STC1200_TivaTM4C1294NCPDT/STC1200_TM4C1294NCPDT.c
/*
 *  =============================== UART ===============================
 */
/* Place into subsections to allow the TI linker to remove items properly */
#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_SECTION(UART_config, ".const:UART_config")
#pragma DATA_SECTION(uartTivaHWAttrs, ".const:uartTivaHWAttrs")
#endif

#include <ti/drivers/UART.h>
#if TI_DRIVERS_UART_DMA
#include <ti/drivers/uart/UARTTivaDMA.h>

UARTTivaDMA_Object uartTivaObjects[STC1200_UARTCOUNT];

const UARTTivaDMA_HWAttrs uartTivaHWAttrs[STC1200_UARTCOUNT] = {
    {
        .baseAddr       = UART0_BASE,
        .intNum         = INT_UART0,
        .intPriority    = (~0),
        .rxChannelIndex = UDMA_CH8_UART0RX,
        .txChannelIndex = UDMA_CH9_UART0TX,
    },
    {
        .baseAddr       = UART1_BASE,
        .intNum         = INT_UART1,
        .intPriority    = (~0),
        .rxChannelIndex = UDMA_CH8_UART1RX,
        .txChannelIndex = UDMA_CH9_UART1TX,
    },
    {
        .baseAddr       = UART2_BASE,
        .intNum         = INT_UART2,
        .intPriority    = (~0),
        .rxChannelIndex = UDMA_CH0_UART2RX,
        .txChannelIndex = UDMA_CH1_UART2TX,
    },
    {
        .baseAddr       = UART3_BASE,
        .intNum         = INT_UART3,
        .intPriority    = (~0),
        .rxChannelIndex = UDMA_CH16_UART3RX,
        .txChannelIndex = UDMA_CH17_UART3TX,
    },
    {
        .baseAddr       = UART4_BASE,
        .intNum         = INT_UART4,
        .intPriority    = (~0),
        .rxChannelIndex = UDMA_CH18_UART4RX,
        .txChannelIndex = UDMA_CH19_UART4TX,
    },
    {
        .baseAddr       = UART5_BASE,
        .intNum         = INT_UART5,
        .intPriority    = (~0),
        .rxChannelIndex = UDMA_CH6_UART5RX,
        .txChannelIndex = UDMA_CH7_UART5TX,
    },
    {
        .baseAddr       = UART6_BASE,
        .intNum         = INT_UART6,
        .intPriority    = (~0),
        .rxChannelIndex = UDMA_CH10_UART6RX,
        .txChannelIndex = UDMA_CH11_UART6TX,
    },
    {
        .baseAddr       = UART7_BASE,
        .intNum         = INT_UART7,
        .intPriority    = (~0),
        .rxChannelIndex = UDMA_CH20_UART7RX,
        .txChannelIndex = UDMA_CH21_UART7TX,
    },
};

const UART_Config UART_config[] = {
    {
        .fxnTablePtr = &UARTTivaDMA_fxnTable,
        .object  = &uartTivaObjects[0],
        .hwAttrs = &uartTivaHWAttrs[0]
    },
    {
        .fxnTablePtr = &UARTTivaDMA_fxnTable,
        .object = &uartTivaObjects[1],
        .hwAttrs = &uartTivaHWAttrs[1]
    },
    {
        .fxnTablePtr = &UARTTivaDMA_fxnTable,
        .object = &uartTivaObjects[2],
        .hwAttrs = &uartTivaHWAttrs[2]
    },
    {
        .fxnTablePtr = &UARTTivaDMA_fxnTable,
        .object = &uartTivaObjects[3],
        .hwAttrs = &uartTivaHWAttrs[3]
    },
    {
        .fxnTablePtr = &UARTTivaDMA_fxnTable,
        .object = &uartTivaObjects[4],
        .hwAttrs = &uartTivaHWAttrs[4]
    },
    {
        .fxnTablePtr = &UARTTivaDMA_fxnTable,
        .object = &uartTivaObjects[5],
        .hwAttrs = &uartTivaHWAttrs[5]
    },
    {
        .fxnTablePtr = &UARTTivaDMA_fxnTable,
        .object = &uartTivaObjects[6],
        .hwAttrs = &uartTivaHWAttrs[6]
    },
    {
        .fxnTablePtr = &UARTTivaDMA_fxnTable,
        .object = &uartTivaObjects[7],
        .hwAttrs = &uartTivaHWAttrs[7]
    },
    {NULL, NULL, NULL}
};

#else

#include <ti/drivers/uart/UARTTiva.h>

UARTTiva_Object uartTivaObjects[STC1200_UARTCOUNT];
unsigned char uartTivaRingBuffer[STC1200_UARTCOUNT][128];

/* UART configuration structure */
const UARTTiva_HWAttrs uartTivaHWAttrs[STC1200_UARTCOUNT] = {
    {
        .baseAddr    = UART0_BASE,
        .intNum      = INT_UART0,
        .intPriority = (~0),
        .flowControl = UART_FLOWCONTROL_NONE,
        .ringBufPtr  = uartTivaRingBuffer[0],
        .ringBufSize = sizeof(uartTivaRingBuffer[0])
    },
    {
        .baseAddr    = UART1_BASE,
        .intNum      = INT_UART1,
        .intPriority = (~0),
        .flowControl = UART_FLOWCONTROL_NONE,
        .ringBufPtr  = uartTivaRingBuffer[1],
        .ringBufSize = sizeof(uartTivaRingBuffer[1])
    },
    {
        .baseAddr    = UART2_BASE,
        .intNum      = INT_UART2,
        .intPriority = (~0),
        .flowControl = UART_FLOWCONTROL_NONE,
        .ringBufPtr  = uartTivaRingBuffer[2],
        .ringBufSize = sizeof(uartTivaRingBuffer[2])
    },
    {
        .baseAddr    = UART3_BASE,
        .intNum      = INT_UART3,
        .intPriority = (~0),
        .flowControl = UART_FLOWCONTROL_NONE,
        .ringBufPtr  = uartTivaRingBuffer[3],
        .ringBufSize = sizeof(uartTivaRingBuffer[3])
    },
    {
        .baseAddr    = UART4_BASE,
        .intNum      = INT_UART4,
        .intPriority = (~0),
        .flowControl = UART_FLOWCONTROL_NONE,
        .ringBufPtr  = uartTivaRingBuffer[4],
        .ringBufSize = sizeof(uartTivaRingBuffer[4])
    },
    {
        .baseAddr    = UART5_BASE,
        .intNum      = INT_UART5,
        .intPriority = (~0),
        .flowControl = UART_FLOWCONTROL_NONE,
        .ringBufPtr  = uartTivaRingBuffer[5],
        .ringBufSize = sizeof(uartTivaRingBuffer[5])
    },
    {
        .baseAddr    = UART6_BASE,
        .intNum      = INT_UART6,
        .intPriority = (~0),
        .flowControl = UART_FLOWCONTROL_NONE,
        .ringBufPtr  = uartTivaRingBuffer[6],
        .ringBufSize = sizeof(uartTivaRingBuffer[6])
    },
    {
        .baseAddr    = UART7_BASE,
        .intNum      = INT_UART7,
        .intPriority = (~0),
        .flowControl = UART_FLOWCONTROL_NONE,
        .ringBufPtr  = uartTivaRingBuffer[7],
        .ringBufSize = sizeof(uartTivaRingBuffer[7])
    },
};

const UART_Config UART_config[] = {
    {
        .fxnTablePtr = &UARTTiva_fxnTable,
        .object  = &uartTivaObjects[0],
        .hwAttrs = &uartTivaHWAttrs[0]
    },
    {
        .fxnTablePtr = &UARTTiva_fxnTable,
        .object  = &uartTivaObjects[1],
        .hwAttrs = &uartTivaHWAttrs[1]
    },
    {
        .fxnTablePtr = &UARTTiva_fxnTable,
        .object  = &uartTivaObjects[2],
        .hwAttrs = &uartTivaHWAttrs[2]
    },
    {
        .fxnTablePtr = &UARTTiva_fxnTable,
        .object  = &uartTivaObjects[3],
        .hwAttrs = &uartTivaHWAttrs[3]
    },
    {
        .fxnTablePtr = &UARTTiva_fxnTable,
        .object  = &uartTivaObjects[4],
        .hwAttrs = &uartTivaHWAttrs[4]
    },
    {
        .fxnTablePtr = &UARTTiva_fxnTable,
        .object  = &uartTivaObjects[5],
        .hwAttrs = &uartTivaHWAttrs[5]
    },
    {
        .fxnTablePtr = &UARTTiva_fxnTable,
        .object  = &uartTivaObjects[6],
        .hwAttrs = &uartTivaHWAttrs[6]
    },
    {
        .fxnTablePtr = &UARTTiva_fxnTable,
        .object  = &uartTivaObjects[7],
        .hwAttrs = &uartTivaHWAttrs[7]
    },
    {NULL, NULL, NULL}
};
#endif /* TI_DRIVERS_UART_DMA */

