rtzaudio/STC1200_TivaTM4C1294NCPDT/STC1200_TM4C1294NCPDT.c
/*
 *  ======== STC1200_initUART ========
 */
void STC1200_initUART(void)
{
	/* Enable UART Peripherals */
    SysCtlPeripheralEnable(SYSCTL_PERIPH_UART0);    
    SysCtlPeripheralEnable(SYSCTL_PERIPH_UART1);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_UART2);        
    SysCtlPeripheralEnable(SYSCTL_PERIPH_UART3);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_UART4);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_UART5);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_UART6);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_UART7);

    // Enable pin PA0 for UART0 U0RX
    GPIOPinConfigure(GPIO_PA0_U0RX);
    GPIOPinTypeUART(GPIO_PORTA_BASE, GPIO_PIN_0);
    // Enable pin PA1 for UART0 U0TX
    GPIOPinConfigure(GPIO_PA1_U0TX);
    GPIOPinTypeUART(GPIO_PORTA_BASE, GPIO_PIN_1);

    // Enable pin PB1 for UART1 U1TX
    GPIOPinConfigure(GPIO_PB1_U1TX);
    GPIOPinTypeUART(GPIO_PORTB_BASE, GPIO_PIN_1);
    // Enable pin PN1 for UART1 U1CTS
    GPIOPinConfigure(GPIO_PN1_U1CTS);
    GPIOPinTypeUART(GPIO_PORTN_BASE, GPIO_PIN_1);
    // Enable pin PN0 for UART1 U1RTS
    GPIOPinConfigure(GPIO_PN0_U1RTS);
    GPIOPinTypeUART(GPIO_PORTN_BASE, GPIO_PIN_0);
    // Enable pin PB0 for UART1 U1RX
    GPIOPinConfigure(GPIO_PB0_U1RX);
    GPIOPinTypeUART(GPIO_PORTB_BASE, GPIO_PIN_0);

    // Enable pin PA6 for UART2 U2RX
    GPIOPinConfigure(GPIO_PA6_U2RX);
    GPIOPinTypeUART(GPIO_PORTA_BASE, GPIO_PIN_6);
    // Enable pin PN2 for UART2 U2RTS
    GPIOPinConfigure(GPIO_PN2_U2RTS);
    GPIOPinTypeUART(GPIO_PORTN_BASE, GPIO_PIN_2);
    // Enable pin PN3 for UART2 U2CTS
    GPIOPinConfigure(GPIO_PN3_U2CTS);
    GPIOPinTypeUART(GPIO_PORTN_BASE, GPIO_PIN_3);
    // Enable pin PA7 for UART2 U2TX
    GPIOPinConfigure(GPIO_PA7_U2TX);
    GPIOPinTypeUART(GPIO_PORTA_BASE, GPIO_PIN_7);

    // Enable pin PN4 for UART3 U3RTS
    GPIOPinConfigure(GPIO_PN4_U3RTS);
    GPIOPinTypeUART(GPIO_PORTN_BASE, GPIO_PIN_4);
    // Enable pin PJ1 for UART3 U3TX
    GPIOPinConfigure(GPIO_PJ1_U3TX);
    GPIOPinTypeUART(GPIO_PORTJ_BASE, GPIO_PIN_1);
    // Enable pin PN5 for UART3 U3CTS
    GPIOPinConfigure(GPIO_PN5_U3CTS);
    GPIOPinTypeUART(GPIO_PORTN_BASE, GPIO_PIN_5);
    // Enable pin PJ0 for UART3 U3RX
    GPIOPinConfigure(GPIO_PJ0_U3RX);
    GPIOPinTypeUART(GPIO_PORTJ_BASE, GPIO_PIN_0);

    // Enable pin PK1 for UART4 U4TX
    GPIOPinConfigure(GPIO_PK1_U4TX);
    GPIOPinTypeUART(GPIO_PORTK_BASE, GPIO_PIN_1);
    // Enable pin PK0 for UART4 U4RX
    GPIOPinConfigure(GPIO_PK0_U4RX);
    GPIOPinTypeUART(GPIO_PORTK_BASE, GPIO_PIN_0);

    // Enable pin PC6 for UART5 U5RX
    GPIOPinConfigure(GPIO_PC6_U5RX);
    GPIOPinTypeUART(GPIO_PORTC_BASE, GPIO_PIN_6);
    // Enable pin PC7 for UART5 U5TX
    GPIOPinConfigure(GPIO_PC7_U5TX);
    GPIOPinTypeUART(GPIO_PORTC_BASE, GPIO_PIN_7);

    // Enable pin PP1 for UART6 U6TX
    GPIOPinConfigure(GPIO_PP1_U6TX);
    GPIOPinTypeUART(GPIO_PORTP_BASE, GPIO_PIN_1);
    // Enable pin PP0 for UART6 U6RX
    GPIOPinConfigure(GPIO_PP0_U6RX);
    GPIOPinTypeUART(GPIO_PORTP_BASE, GPIO_PIN_0);

    // Enable pin PC4 for UART7 U7RX
    GPIOPinConfigure(GPIO_PC4_U7RX);
    GPIOPinTypeUART(GPIO_PORTC_BASE, GPIO_PIN_4);
    // Enable pin PC5 for UART7 U7TX
    GPIOPinConfigure(GPIO_PC5_U7TX);
    GPIOPinTypeUART(GPIO_PORTC_BASE, GPIO_PIN_5);
    
    /* Initialize the UART driver */
#if TI_DRIVERS_UART_DMA
    STC1200_initDMA();
#endif
    UART_init();
}

/*
 *  =============================== Watchdog ===============================
 */
/* Place into subsections to allow the TI linker to remove items properly */
#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_SECTION(Watchdog_config, ".const:Watchdog_config")
#pragma DATA_SECTION(watchdogTivaHWAttrs, ".const:watchdogTivaHWAttrs")
#endif

#include <ti/drivers/Watchdog.h>
#include <ti/drivers/watchdog/WatchdogTiva.h>

WatchdogTiva_Object watchdogTivaObjects[STC1200_WATCHDOGCOUNT];

const WatchdogTiva_HWAttrs watchdogTivaHWAttrs[STC1200_WATCHDOGCOUNT] = {
    {
        .baseAddr = WATCHDOG0_BASE,
        .intNum = INT_WATCHDOG,
        .intPriority = (~0),
        .reloadValue = 80000000 // 1 second period at default CPU clock freq
    },
};

const Watchdog_Config Watchdog_config[] = {
    {
        .fxnTablePtr = &WatchdogTiva_fxnTable,
        .object = &watchdogTivaObjects[0],
        .hwAttrs = &watchdogTivaHWAttrs[0]
    },
    {NULL, NULL, NULL},
};

/*
 *  ======== STC1200_initWatchdog ========
 *
 * NOTE: To use the other watchdog timer with base address WATCHDOG1_BASE,
 *       an additional function call may need be made to enable PIOSC. Enabling
 *       WDOG1 does not do this. Enabling another peripheral that uses PIOSC
 *       such as ADC0 or SSI0, however, will do so. Example:
 *
 *       SysCtlPeripheralEnable(SYSCTL_PERIPH_ADC0);
 *       SysCtlPeripheralEnable(SYSCTL_PERIPH_WDOG1);
 *
 *       See the following forum post for more information:
 *       http://e2e.ti.com/support/microcontrollers/stellaris_arm_cortex-m3_microcontroller/f/471/p/176487/654390.aspx#654390
 */
void STC1200_initWatchdog(void)
{
    /* Enable peripherals used by Watchdog */
    SysCtlPeripheralEnable(SYSCTL_PERIPH_WDOG0);

    /* Initialize the Watchdog driver */
    Watchdog_init();
}

/*
 *  =============================== WiFi ===============================
 */
#if TI_DRIVERS_WIFI_INCLUDED
/* Place into subsections to allow the TI linker to remove items properly */
#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_SECTION(WiFi_config, ".const:WiFi_config")
#pragma DATA_SECTION(wiFiCC3100HWAttrs, ".const:wiFiCC3100HWAttrs")
#endif

#include <ti/drivers/WiFi.h>
#include <ti/drivers/wifi/WiFiCC3100.h>

WiFiCC3100_Object wiFiCC3100Objects[DK_TM4C129X_WIFICOUNT];

const WiFiCC3100_HWAttrs wiFiCC3100HWAttrs[DK_TM4C129X_WIFICOUNT] = {
    {
        .irqPort = GPIO_PORTS_BASE,
        .irqPin = GPIO_PIN_2,
        .irqIntNum = INT_GPIOS,

        .csPort = GPIO_PORTQ_BASE,
        .csPin = GPIO_PIN_7,

        .enPort = GPIO_PORTN_BASE,
        .enPin = GPIO_PIN_7
    }
};

const WiFi_Config WiFi_config[] = {
    {
        .fxnTablePtr = &WiFiCC3100_fxnTable,
        .object = &wiFiCC3100Objects[0],
        .hwAttrs = &wiFiCC3100HWAttrs[0]
    },
    {NULL,NULL, NULL},
};

/*
 *  ======== STC1200_initWiFi ========
 */
void STC1200_initWiFi(void)
{
    /* Configure EN & CS pins to disable CC3100 */
    GPIOPinTypeGPIOOutput(GPIO_PORTQ_BASE, GPIO_PIN_7);
    GPIOPinTypeGPIOOutput(GPIO_PORTN_BASE, GPIO_PIN_7);
    GPIOPinWrite(GPIO_PORTQ_BASE, GPIO_PIN_7, GPIO_PIN_7);
    GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_7, 0);

    /* Configure SSI2 for CC3100 */
    SysCtlPeripheralEnable(SYSCTL_PERIPH_SSI2);
    GPIOPinConfigure(GPIO_PG7_SSI2CLK);
    GPIOPinConfigure(GPIO_PG5_SSI2XDAT0);
    GPIOPinConfigure(GPIO_PG4_SSI2XDAT1);
    GPIOPinTypeSSI(GPIO_PORTG_BASE, GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_7);

    /* Configure IRQ pin */
    GPIOPinTypeGPIOInput(GPIO_PORTS_BASE, GPIO_PIN_2);
    GPIOPadConfigSet(GPIO_PORTS_BASE, GPIO_PIN_2, GPIO_STRENGTH_2MA,
                     GPIO_PIN_TYPE_STD_WPD);
    GPIOIntTypeSet(GPIO_PORTS_BASE, GPIO_PIN_2, GPIO_RISING_EDGE);

    SPI_init();
    STC1200_initDMA();

    WiFi_init();}
#endif /* TI_DRIVERS_WIFI_INCLUDED */
